mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf16xn/common/mb9bf16xn.h
typedef struct stc_sdif_ssrst_field
{
        __IO   uint8_t  SWRSTALL                 :1;
        __IO   uint8_t  SWRSTCMDLN               :1;
        __IO   uint8_t  SWRSTDATLN               :1;
        __IO   uint8_t  RESERVED0                :5;
} stc_sdif_ssrst_field_t;

typedef struct stc_sdif_snintst_field
{
        __IO  uint16_t  CMDCMPLT                 :1;
        __IO  uint16_t  TRSFCMPLT                :1;
        __IO  uint16_t  BLCKGEVNT                :1;
        __IO  uint16_t  DMAINT                   :1;
        __IO  uint16_t  BUFWRRDY                 :1;
        __IO  uint16_t  BUFRDRDY                 :1;
        __IO  uint16_t  CARDINS                  :1;
        __IO  uint16_t  CARDRMV                  :1;
        __IO  uint16_t  CARDINT                  :1;
        __IO  uint16_t  INT_A                    :1;
        __IO  uint16_t  INT_B                    :1;
        __IO  uint16_t  INT_C                    :1;
        __IO  uint16_t  RETUNEEVT                :1;
        __IO  uint16_t  RESERVED0                :2;
        __IO  uint16_t  ERRORINT                 :1;
} stc_sdif_snintst_field_t;

typedef struct stc_sdif_seintst_field
{
        __IO  uint16_t  CMDTOERR                 :1;
        __IO  uint16_t  CMDCRCERR                :1;
        __IO  uint16_t  CMDEBERR                 :1;
        __IO  uint16_t  CMDIDXERR                :1;
        __IO  uint16_t  DTTOERR                  :1;
        __IO  uint16_t  DTCRCERR                 :1;
        __IO  uint16_t  DTEBERR                  :1;
        __IO  uint16_t  CRTLMTERR                :1;
        __IO  uint16_t  ACMD12ERR                :1;
        __IO  uint16_t  ADMAERR                  :1;
        __IO  uint16_t  TUNINGERR                :1;
        __IO  uint16_t  RESERVED0                :1;
        __IO  uint16_t  BTACKERR                 :1;
        __IO  uint16_t  ACMD19ERR                :1;
        __IO  uint16_t  AHBMSTERR                :1;
        __IO  uint16_t  RESERVED1                :1;
} stc_sdif_seintst_field_t;

typedef struct stc_sdif_snintste_field
{
        __IO  uint16_t  CMDCMPLTS                :1;
        __IO  uint16_t  TRSFCMPLTS               :1;
        __IO  uint16_t  BLCKGEVNTS               :1;
        __IO  uint16_t  DMAINTS                  :1;
        __IO  uint16_t  BUFWRRDYS                :1;
        __IO  uint16_t  BUFRDRDYS                :1;
        __IO  uint16_t  CARDINSS                 :1;
        __IO  uint16_t  CARDRMVS                 :1;
        __IO  uint16_t  CARDINTS                 :1;
        __IO  uint16_t  INT_AS                   :1;
        __IO  uint16_t  INT_BS                   :1;
        __IO  uint16_t  INT_CS                   :1;
        __IO  uint16_t  RETUNEEVTS               :1;
        __IO  uint16_t  RESERVED0                :3;
} stc_sdif_snintste_field_t;

typedef struct stc_sdif_seintste_field
{
        __IO  uint16_t  CMDTOERRS                :1;
        __IO  uint16_t  CMDCRCERRS               :1;
        __IO  uint16_t  CMDEBERRS                :1;
        __IO  uint16_t  CMDIDXERRS               :1;
        __IO  uint16_t  DTTOERRS                 :1;
        __IO  uint16_t  DTCRCERRS                :1;
        __IO  uint16_t  DTEBERRS                 :1;
        __IO  uint16_t  CRTLMTERRS               :1;
        __IO  uint16_t  ACMD12ERRS               :1;
        __IO  uint16_t  ADMAERRS                 :1;
        __IO  uint16_t  TUNINGERRS               :1;
        __IO  uint16_t  RESERVED0                :1;
        __IO  uint16_t  BTACKERRS                :1;
        __IO  uint16_t  ACMD19ERRS               :1;
        __IO  uint16_t  AHBMSTERRS               :1;
        __IO  uint16_t  RESERVED1                :1;
} stc_sdif_seintste_field_t;

typedef struct stc_sdif_snintsge_field
{
        __IO  uint16_t  CMDCMPLTG                :1;
        __IO  uint16_t  TRSFCMPLTG               :1;
        __IO  uint16_t  BLCKGEVNTG               :1;
        __IO  uint16_t  DMAINTG                  :1;
        __IO  uint16_t  BUFWRRDYG                :1;
        __IO  uint16_t  BUFRDRDYG                :1;
        __IO  uint16_t  CARDINSG                 :1;
        __IO  uint16_t  CARDRMVG                 :1;
        __IO  uint16_t  CARDINTG                 :1;
        __IO  uint16_t  INT_AG                   :1;
        __IO  uint16_t  INT_BG                   :1;
        __IO  uint16_t  INT_CG                   :1;
        __IO  uint16_t  RETUNEEVTG               :1;
        __IO  uint16_t  RESERVED0                :3;
} stc_sdif_snintsge_field_t;

typedef struct stc_sdif_seintsge_field
{
        __IO  uint16_t  CMDTOERRG                :1;
        __IO  uint16_t  CMDCRCERRG               :1;
        __IO  uint16_t  CMDEBERRG                :1;
        __IO  uint16_t  CMDIDXERRG               :1;
        __IO  uint16_t  DTTOERRG                 :1;
        __IO  uint16_t  DTCRCERRG                :1;
        __IO  uint16_t  DTEBERRG                 :1;
        __IO  uint16_t  CRTLMTERRG               :1;
        __IO  uint16_t  ACMD12ERRG               :1;
        __IO  uint16_t  ADMAERRG                 :1;
        __IO  uint16_t  TUNINGERRG               :1;
        __IO  uint16_t  RESERVED0                :1;
        __IO  uint16_t  BTACKERRG                :1;
        __IO  uint16_t  ACMD19ERRG               :1;
        __IO  uint16_t  AHBMSTERRG               :1;
        __IO  uint16_t  RESERVED1                :1;
} stc_sdif_seintsge_field_t;

typedef struct stc_sdif_sacmdest_field
{
        __IO  uint16_t  ACMD12NOEX               :1;
        __IO  uint16_t  ACMDTOERR                :1;
        __IO  uint16_t  ACMDCRCERR               :1;
        __IO  uint16_t  ACMDEBERR                :1;
        __IO  uint16_t  ACMDIDXERR               :1;
        __IO  uint16_t  RESERVED0                :2;
        __IO  uint16_t  CMDND12ERR               :1;
        __IO  uint16_t  RESERVED1                :8;
} stc_sdif_sacmdest_field_t;

