mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf16xn/common/mb9bf16xn.h
#define bFM_MFT1_OCU_OCSB32_OTD2                  *((volatile  uint8_t *)(0x424223A0UL))
#define bFM4_MFT1_OCU_OCSB32_OTD2                 *((volatile  uint8_t *)(0x424223A0UL))
#define bFM_MFT1_OCU_OCSB32_OTD3                  *((volatile  uint8_t *)(0x424223A4UL))
#define bFM4_MFT1_OCU_OCSB32_OTD3                 *((volatile  uint8_t *)(0x424223A4UL))
#define bFM_MFT1_OCU_OCSB32_CMOD                  *((volatile  uint8_t *)(0x424223B0UL))
#define bFM4_MFT1_OCU_OCSB32_CMOD                 *((volatile  uint8_t *)(0x424223B0UL))
#define bFM_MFT1_OCU_OCSB32_FM4                   *((volatile  uint8_t *)(0x424223BCUL))
#define bFM4_MFT1_OCU_OCSB32_FM4                  *((volatile  uint8_t *)(0x424223BCUL))

#define bFM_MFT1_OCU_OCSB54_OTD4                  *((volatile  uint8_t *)(0x42422420UL))
#define bFM4_MFT1_OCU_OCSB54_OTD4                 *((volatile  uint8_t *)(0x42422420UL))
#define bFM_MFT1_OCU_OCSB54_OTD5                  *((volatile  uint8_t *)(0x42422424UL))
#define bFM4_MFT1_OCU_OCSB54_OTD5                 *((volatile  uint8_t *)(0x42422424UL))
#define bFM_MFT1_OCU_OCSB54_CMOD                  *((volatile  uint8_t *)(0x42422430UL))
#define bFM4_MFT1_OCU_OCSB54_CMOD                 *((volatile  uint8_t *)(0x42422430UL))
#define bFM_MFT1_OCU_OCSB54_FM4                   *((volatile  uint8_t *)(0x4242243CUL))
#define bFM4_MFT1_OCU_OCSB54_FM4                  *((volatile  uint8_t *)(0x4242243CUL))

#define bFM_MFT1_OCU_OCSC_MOD0                    *((volatile  uint8_t *)(0x424224A0UL))
#define bFM4_MFT1_OCU_OCSC_MOD0                   *((volatile  uint8_t *)(0x424224A0UL))
#define bFM_MFT1_OCU_OCSC_MOD1                    *((volatile  uint8_t *)(0x424224A4UL))
#define bFM4_MFT1_OCU_OCSC_MOD1                   *((volatile  uint8_t *)(0x424224A4UL))
#define bFM_MFT1_OCU_OCSC_MOD2                    *((volatile  uint8_t *)(0x424224A8UL))
#define bFM4_MFT1_OCU_OCSC_MOD2                   *((volatile  uint8_t *)(0x424224A8UL))
#define bFM_MFT1_OCU_OCSC_MOD3                    *((volatile  uint8_t *)(0x424224ACUL))
#define bFM4_MFT1_OCU_OCSC_MOD3                   *((volatile  uint8_t *)(0x424224ACUL))
#define bFM_MFT1_OCU_OCSC_MOD4                    *((volatile  uint8_t *)(0x424224B0UL))
#define bFM4_MFT1_OCU_OCSC_MOD4                   *((volatile  uint8_t *)(0x424224B0UL))
#define bFM_MFT1_OCU_OCSC_MOD5                    *((volatile  uint8_t *)(0x424224B4UL))
#define bFM4_MFT1_OCU_OCSC_MOD5                   *((volatile  uint8_t *)(0x424224B4UL))

#define bFM_MFT1_WFG_NZCL_DTIEA                   *((volatile  uint16_t*)(0x42423680UL))
#define bFM4_MFT1_WFG_NZCL_DTIEA                  *((volatile  uint16_t*)(0x42423680UL))
#define bFM_MFT1_WFG_NZCL_SDTI                    *((volatile  uint16_t*)(0x42423690UL))
#define bFM4_MFT1_WFG_NZCL_SDTI                   *((volatile  uint16_t*)(0x42423690UL))
#define bFM_MFT1_WFG_NZCL_DTIEB                   *((volatile  uint16_t*)(0x42423694UL))
#define bFM4_MFT1_WFG_NZCL_DTIEB                  *((volatile  uint16_t*)(0x42423694UL))
#define bFM_MFT1_WFG_NZCL_DIMA                    *((volatile  uint16_t*)(0x424236A0UL))
#define bFM4_MFT1_WFG_NZCL_DIMA                   *((volatile  uint16_t*)(0x424236A0UL))
#define bFM_MFT1_WFG_NZCL_DIMB                    *((volatile  uint16_t*)(0x424236A4UL))
#define bFM4_MFT1_WFG_NZCL_DIMB                   *((volatile  uint16_t*)(0x424236A4UL))
#define bFM_MFT1_WFG_NZCL_WIM10                   *((volatile  uint16_t*)(0x424236B0UL))
#define bFM4_MFT1_WFG_NZCL_WIM10                  *((volatile  uint16_t*)(0x424236B0UL))
#define bFM_MFT1_WFG_NZCL_WIM32                   *((volatile  uint16_t*)(0x424236B4UL))
#define bFM4_MFT1_WFG_NZCL_WIM32                  *((volatile  uint16_t*)(0x424236B4UL))
#define bFM_MFT1_WFG_NZCL_WIM54                   *((volatile  uint16_t*)(0x424236B8UL))
#define bFM4_MFT1_WFG_NZCL_WIM54                  *((volatile  uint16_t*)(0x424236B8UL))

#define bFM_MFT1_WFG_WFIR_DTIFA                   *((volatile  uint16_t*)(0x42423600UL))
#define bFM4_MFT1_WFG_WFIR_DTIFA                  *((volatile  uint16_t*)(0x42423600UL))
#define bFM_MFT1_WFG_WFIR_DTICA                   *((volatile  uint16_t*)(0x42423604UL))
#define bFM4_MFT1_WFG_WFIR_DTICA                  *((volatile  uint16_t*)(0x42423604UL))
#define bFM_MFT1_WFG_WFIR_DTIFB                   *((volatile  uint16_t*)(0x42423608UL))
#define bFM4_MFT1_WFG_WFIR_DTIFB                  *((volatile  uint16_t*)(0x42423608UL))
#define bFM_MFT1_WFG_WFIR_DTICB                   *((volatile  uint16_t*)(0x4242360CUL))
#define bFM4_MFT1_WFG_WFIR_DTICB                  *((volatile  uint16_t*)(0x4242360CUL))
#define bFM_MFT1_WFG_WFIR_TMIF10                  *((volatile  uint16_t*)(0x42423610UL))
#define bFM4_MFT1_WFG_WFIR_TMIF10                 *((volatile  uint16_t*)(0x42423610UL))
#define bFM_MFT1_WFG_WFIR_TMIC10                  *((volatile  uint16_t*)(0x42423614UL))
#define bFM4_MFT1_WFG_WFIR_TMIC10                 *((volatile  uint16_t*)(0x42423614UL))
#define bFM_MFT1_WFG_WFIR_TMIE10                  *((volatile  uint16_t*)(0x42423618UL))
#define bFM4_MFT1_WFG_WFIR_TMIE10                 *((volatile  uint16_t*)(0x42423618UL))
#define bFM_MFT1_WFG_WFIR_TMIS10                  *((volatile  uint16_t*)(0x4242361CUL))
#define bFM4_MFT1_WFG_WFIR_TMIS10                 *((volatile  uint16_t*)(0x4242361CUL))
#define bFM_MFT1_WFG_WFIR_TMIF32                  *((volatile  uint16_t*)(0x42423620UL))
#define bFM4_MFT1_WFG_WFIR_TMIF32                 *((volatile  uint16_t*)(0x42423620UL))
#define bFM_MFT1_WFG_WFIR_TMIC32                  *((volatile  uint16_t*)(0x42423624UL))
#define bFM4_MFT1_WFG_WFIR_TMIC32                 *((volatile  uint16_t*)(0x42423624UL))
#define bFM_MFT1_WFG_WFIR_TMIE32                  *((volatile  uint16_t*)(0x42423628UL))
#define bFM4_MFT1_WFG_WFIR_TMIE32                 *((volatile  uint16_t*)(0x42423628UL))
#define bFM_MFT1_WFG_WFIR_TMIS32                  *((volatile  uint16_t*)(0x4242362CUL))
#define bFM4_MFT1_WFG_WFIR_TMIS32                 *((volatile  uint16_t*)(0x4242362CUL))
#define bFM_MFT1_WFG_WFIR_TMIF54                  *((volatile  uint16_t*)(0x42423630UL))
#define bFM4_MFT1_WFG_WFIR_TMIF54                 *((volatile  uint16_t*)(0x42423630UL))
#define bFM_MFT1_WFG_WFIR_TMIC54                  *((volatile  uint16_t*)(0x42423634UL))
#define bFM4_MFT1_WFG_WFIR_TMIC54                 *((volatile  uint16_t*)(0x42423634UL))
#define bFM_MFT1_WFG_WFIR_TMIE54                  *((volatile  uint16_t*)(0x42423638UL))
#define bFM4_MFT1_WFG_WFIR_TMIE54                 *((volatile  uint16_t*)(0x42423638UL))
#define bFM_MFT1_WFG_WFIR_TMIS54                  *((volatile  uint16_t*)(0x4242363CUL))
#define bFM4_MFT1_WFG_WFIR_TMIS54                 *((volatile  uint16_t*)(0x4242363CUL))


